[
  {
    "title": "Preliminary findings on the establishment of a community health centre for urban renewal area II",
    "authors": [
      "EF Gerbasi"
    ],
    "year": "1971",
    "abstract": "… H\"eal th care ln terms of the World Health Organization definition implies an··_integrated \nhealth and social service delivery system. The community health centre model outline is based …",
    "link": "https://winnspace.uwinnipeg.ca/bitstream/handle/10680/1077/237-1971-Gerbasi-EstablishmentCommunityHealthCentre-WEB.pdf?sequence=1"
  },
  {
    "title": "Towards Integrated Service Delivery for Primary Health Care: Can Programs Meet People's Lives?",
    "authors": [
      "V Lin - Australian Journal of Primary Health",
      "2000"
    ],
    "year": "2000",
    "abstract": "… Nearly 25 years ago, I did a public health internship, working in a neighbourhood health centre in Houston, Texas. I went out one day with the community health educator, with the task …",
    "link": "https://www.publish.csiro.au/PY/PY00033"
  },
  {
    "title": "Equitable and healthy city planning: towards healthy urban governance in the century of the city",
    "authors": [
      "J Corburn - Healthy cities: the theory",
      "policy",
      "and practice of value …",
      "2017"
    ],
    "year": "2017",
    "abstract": "… improvement schemes, such as water service delivery infrastructure, sewage systems, public \n… Era neighbourhood surveys and the neighbourhood health centre movement, twenty-first …",
    "link": "https://link.springer.com/chapter/10.1007/978-1-4939-6694-3_2"
  },
  {
    "title": "Urgent care centres for reducing the demand on emergency departments: a scoping review of published quantitative and qualitative studies",
    "authors": [
      "F Savira",
      "M Frith",
      "CJ Aditya",
      "S Randall… - Medical Journal of …",
      "2025"
    ],
    "year": "2025",
    "abstract": "… as a primary care-based facility or model of care for people with low acuity conditions. The \n… visited the emergency room (USA) Neighbourhood health centre; in-person only; standalone …",
    "link": "https://onlinelibrary.wiley.com/doi/abs/10.5694/mja2.52663"
  },
  {
    "title": "Teledermatology in Belgium: a pilot study",
    "authors": [
      "J Kips",
      "J Lambert",
      "K Ongenae",
      "A De Sutter… - Acta Clinica …",
      "2020"
    ],
    "year": "2020",
    "abstract": "… The setting for the study was a neighbourhood health centre in Ghent and a group practice \nin Merelbeke. The teleconsults were answered by three dermatologists of Ghent University …",
    "link": "https://www.tandfonline.com/doi/abs/10.1080/17843286.2018.1561812"
  },
  {
    "title": "\" NOT FOR CITATION WITHOUT PERMISSION",
    "authors": [
      "J Abelson",
      "B Hutchison"
    ],
    "year": "1994",
    "abstract": "… which emphasize the coordination of service delivery either within or across organizations. \nA … Attempts to integrate health and social services within a neighbourhood health centre in …",
    "link": "https://www.academia.edu/download/49136299/Primary_Health_Care_Models_A_Review_of_t20160926-27110-18jc5wy.pdf"
  },
  {
    "title": "Patient satisfaction: a survey of dental outpatients at the Lagos University Teaching Hospital, Nigeria",
    "authors": [
      "OO Orenuga",
      "OO Sofola",
      "OG Uti"
    ],
    "year": "2009",
    "abstract": "… service delivery. This observation is comparable to findings in the present study on access \nto the facility and service delivery. … services at a neighbourhood health centre. J. Public Hlth. …",
    "link": "https://ir.unilag.edu.ng/handle/123456789/10424"
  },
  {
    "title": "Emerging models of clinical services for men who have sex with men: focused versus comprehensive approaches",
    "authors": [
      "KH Mayer",
      "R Vanderwarker",
      "C Grasso… - Sexual Health",
      "2016"
    ],
    "year": "2016",
    "abstract": "… , not as a gay clinic, but as a neighbourhood health centre that had a substantial number of \n… Both MSM and LGBT specialised health centres may be seen as models of service delivery …",
    "link": "https://www.publish.csiro.au/sh/SH16119"
  },
  {
    "title": "Primary care strategies to improve childhood immunisation uptake in developed countries: systematic review",
    "authors": [
      "N Williams",
      "H Woodward",
      "A Majeed… - JRSM short …",
      "2011"
    ],
    "year": "2011",
    "abstract": "… 1991-1993 Teaching hospital paediatric clinic and neighbourhood health centre, Rochester, \n… Included studies were heterogenous in setting, service delivery, intervention delivery and …",
    "link": "https://journals.sagepub.com/doi/abs/10.1258/shorts.2011.011112"
  },
  {
    "title": "Impacting Community Strength and Sustainability: Community-Campus Engagement and Poverty Reduction at Station 20 West Community Enterprise Centre",
    "authors": [
      "IM Findlay",
      "SR Sunny… - … ",
      "SK: Community Institute …",
      "2017"
    ],
    "year": "2017",
    "abstract": "… the cultural competency of just our neighbourhood health centre, those sessions were then \n… among co-locators has added to their effectiveness in service delivery: “It’s helped us, too, …",
    "link": "https://cuisr.usask.ca/documents/publications/2015-2019/Final%20Report%20CFICE%20S20W_2017.pdf"
  },
  {
    "title": "Low-Cost Rural Health Care and Health Manpower: Training",
    "authors": [
      "FM Delaney"
    ],
    "year": "1976",
    "abstract": "Cette bibliographie tente de coordonner une information sur les différentes méthodes de \ndistribuer des soins aux populations rurales à travers le monde, et surtout dans les pays en …",
    "link": "https://idl-bnc-idrc.dspacedirect.org/server/api/core/bitstreams/5f815917-229f-466c-9405-bc39a4052ee4/content"
  },
  {
    "title": "The 15-Minute City—The Geographical Proximity of Services in Krakow. Sustainability 2022, 14, 7103",
    "authors": [
      "A Noworól",
      "P Kopyciński",
      "P Hałat",
      "J Salamon",
      "A Hołuj"
    ],
    "year": "2022",
    "abstract": "… creating an inventory that goes beyond the data available in spatial databases in order to \napply network analysis and verify the actual time required to reach specific service delivery …",
    "link": "https://pdfs.semanticscholar.org/d028/b8323ebf32cf188f62cc1f8361399e33dadf.pdf"
  },
  {
    "title": "Consumer participation in community health services: lessons from overseas",
    "authors": [
      "PF Gross - Australian Journal of Social Issues",
      "1975"
    ],
    "year": "1975",
    "abstract": "… the American pioneers of the neighbourhood health centre movement. This particular literature \n… In this new human service delivery system merging all social services. we might expect to …",
    "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/j.1839-4655.1975.tb01241.x"
  },
  {
    "title": "Quantitative Determinants of Need and Demand for Primary Care in the District of Columbia",
    "authors": [
      "JY Andoh"
    ],
    "year": "2015",
    "abstract": "This study, quantitative determinants of need and demand for primary health care in the \nDistrict of Columbia (DCPC), analysed data over a twenty-year period from 1985 to 2004, on …",
    "link": "https://search.proquest.com/openview/295fe2f58f9c63cbb83995df792e9bf9/1?pq-origsite=gscholar&cbl=2026366&diss=y"
  },
  {
    "title": "The utilization of, and the attitudes of the public to, general practitioner services: A geographical study in West Glamorgan",
    "authors": [
      "DR Phillips"
    ],
    "year": "1978",
    "abstract": "This thesis is a study of public attitudes to and utilisation of general practitioner medical \nservices in West Glamorgan, A review was undertaken of geographical and social scientific …",
    "link": "https://search.proquest.com/openview/61b6a2180db31cc4c2ac469cfbe3accc/1?pq-origsite=gscholar&cbl=2026366&diss=y"
  },
  {
    "title": "Barriers to professional roles in urban community development",
    "authors": [
      "M O'Collins - Australian Journal of Social Issues",
      "1972"
    ],
    "year": "1972",
    "abstract": "… or the programming and service delivery in low-income urban … may lessen the effectiveness \nof service delivery and, even in a … his views about a neighbourhood health centre. Cited in …",
    "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/j.1839-4655.1972.tb00479.x"
  },
  {
    "title": "Reconstructing Social Housing: The Socio-spatial Effects of Welfare State Transformation in Toronto's Regent Park",
    "authors": [
      "SA Kelly"
    ],
    "year": "2015",
    "abstract": "This dissertation charts the socio-spatial impacts of welfare state reform on the landscape of \npublic housing, and the transformation in modes of governance that mark the shift from a …",
    "link": "https://search.proquest.com/openview/0d64c00703aa43695832c6a90cbf14d1/1?pq-origsite=gscholar&cbl=18750"
  },
  {
    "title": "Overview and Scrutiny Committee",
    "authors": [
      "G Vacancy",
      "MH Kania"
    ],
    "year": "N/A",
    "abstract": "… • We have opened Hornsey neighbourhood Health Centre bringing together 18 different health \n… to develop the local plans and shape service delivery. The responses have been shared …",
    "link": "http://www.minutes.haringey.gov.uk/Published/C00000128/M00004533/$$ADocPackPublic.pdf"
  },
  {
    "title": "Re-Conceptualizing\" Contributing\" Homelessness and Unpaid Labour in a Neo-Liberal Climate",
    "authors": [
      "MR Choy"
    ],
    "year": "2014",
    "abstract": "The goal of this research was to challenge notions of “contributing” in active citizen discourse. \nThis was done by exploring how individuals experiencing homelessness give back to their …",
    "link": "https://yorkspace.library.yorku.ca/items/6302a70b-ff9e-42a4-ba65-c7b2882a39cd"
  },
  {
    "title": "Title not found",
    "authors": [
      "G Ben-Tovim",
      "L Beavers",
      "T Bennett",
      "J Garrett",
      "M Gibney…"
    ],
    "year": "N/A",
    "abstract": "",
    "link": "N/A"
  }
]