[
  {
    "title": "Preliminary findings on the establishment of a community health centre for urban renewal area II",
    "authors": [
      "EF Gerbasi"
    ],
    "year": "1971",
    "abstract": "… H\"eal th care ln terms of the World Health Organization definition implies an··_integrated \nhealth and social service delivery system. The community health centre model outline is based …",
    "link": "https://winnspace.uwinnipeg.ca/bitstream/handle/10680/1077/237-1971-Gerbasi-EstablishmentCommunityHealthCentre-WEB.pdf?sequence=1"
  },
  {
    "title": "Integrating care: The architecture of the comprehensive health centre",
    "authors": [
      "J De Syllas"
    ],
    "year": "2015",
    "abstract": "… unified administration and a more coherent model of care for the integration of primary, … \nand longer-term plans to provide a neighbourhood health centre for every 20,000 people, a total …",
    "link": "https://www.taylorfrancis.com/books/mono/10.4324/9781315735320/integrating-care-justin-de-syllas"
  },
  {
    "title": "An international comparison of two systems of community mental health care",
    "authors": [
      "D Tantam",
      "BJ Burns - Psychological Medicine",
      "1979"
    ],
    "year": "1979",
    "abstract": "… ment in the neighbourhood health centre and some pre-paid … of community mental health service delivery in the US. The … colleague with a neighbourhood health centre is therefore a …",
    "link": "https://www.cambridge.org/core/journals/psychological-medicine/article/an-international-comparison-of-two-systems-of-community-mental-health-care/4DED2B284D6F2F6753A715AC6028BF37"
  },
  {
    "title": "Urgent care centres for reducing the demand on emergency departments: a scoping review of published quantitative and qualitative studies",
    "authors": [
      "F Savira",
      "M Frith",
      "CJ Aditya",
      "S Randall… - Medical Journal of …",
      "2025"
    ],
    "year": "2025",
    "abstract": "… as a primary care-based facility or model of care for people with low acuity conditions. The \n… visited the emergency room (USA) Neighbourhood health centre; in-person only; standalone …",
    "link": "https://onlinelibrary.wiley.com/doi/abs/10.5694/mja2.52663"
  },
  {
    "title": "The REACH Centre: Its History and Work III. A Study of the Quality of Paediatric Care",
    "authors": [
      "RS Tonkin - Canadian Journal of Public Health/Revue Canadienne …",
      "1979"
    ],
    "year": "1979",
    "abstract": "… studies suggest that organizational issues, methods of service delivery, and the need to \nidentify clearly those in the community responsible for seeing that a patient's immunization status …",
    "link": "https://www.jstor.org/stable/41987779"
  },
  {
    "title": "Teledermatology in Belgium: a pilot study",
    "authors": [
      "J Kips",
      "J Lambert",
      "K Ongenae",
      "A De Sutter… - Acta Clinica …",
      "2020"
    ],
    "year": "2020",
    "abstract": "… The setting for the study was a neighbourhood health centre in Ghent and a group practice \nin Merelbeke. The teleconsults were answered by three dermatologists of Ghent University …",
    "link": "https://www.tandfonline.com/doi/abs/10.1080/17843286.2018.1561812"
  },
  {
    "title": "\" NOT FOR CITATION WITHOUT PERMISSION",
    "authors": [
      "J Abelson",
      "B Hutchison"
    ],
    "year": "1994",
    "abstract": "… which emphasize the coordination of service delivery either within or across organizations. \nA … Attempts to integrate health and social services within a neighbourhood health centre in …",
    "link": "https://www.academia.edu/download/49136299/Primary_Health_Care_Models_A_Review_of_t20160926-27110-18jc5wy.pdf"
  },
  {
    "title": "The 15-minute city—the geographical proximity of services in Krakow",
    "authors": [
      "A Noworól",
      "P Kopyciński",
      "P Hałat",
      "J Salamon",
      "A Hołuj - Sustainability",
      "2022"
    ],
    "year": "2022",
    "abstract": "… creating an inventory that goes beyond the data available in spatial databases in order to \napply network analysis and verify the actual time required to reach specific service delivery …",
    "link": "https://www.mdpi.com/2071-1050/14/12/7103"
  },
  {
    "title": "Impacting Community Strength and Sustainability: Community-Campus Engagement and Poverty Reduction at Station 20 West Community Enterprise Centre",
    "authors": [
      "IM Findlay",
      "SR Sunny… - … ",
      "SK: Community Institute …",
      "2017"
    ],
    "year": "2017",
    "abstract": "… the cultural competency of just our neighbourhood health centre, those sessions were then \n… among co-locators has added to their effectiveness in service delivery: “It’s helped us, too, …",
    "link": "https://cuisr.usask.ca/documents/publications/2015-2019/Final%20Report%20CFICE%20S20W_2017.pdf"
  },
  {
    "title": "Low-Cost Rural Health Care and Health Manpower: Training",
    "authors": [
      "FM Delaney"
    ],
    "year": "1976",
    "abstract": "Cette bibliographie tente de coordonner une information sur les différentes méthodes de \ndistribuer des soins aux populations rurales à travers le monde, et surtout dans les pays en …",
    "link": "https://idl-bnc-idrc.dspacedirect.org/server/api/core/bitstreams/5f815917-229f-466c-9405-bc39a4052ee4/content"
  },
  {
    "title": "Intra-Urban Disparities in the Provision of Primary Health-Care: An Examination of Three New Zealand Urban Areas1",
    "authors": [
      "JR Barnett",
      "P Newton - The Australian and New Zealand …",
      "1977"
    ],
    "year": "1977",
    "abstract": "The residential areas of cities comprise three constituent elements; population, serv-ices \nand facilities. Numerous studies have been undertaken which suggest that most cities in …",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/144078337701300112"
  },
  {
    "title": "The practitioner-researcher",
    "authors": [
      "F McDermott - Handbook of Research Methods in Social Work",
      "2025"
    ],
    "year": "2025",
    "abstract": "… outer suburban community who attend the neighbourhood health centre? 3. Evaluations, for \n… social worker enters the front line of service delivery, and few organisations sequester front-…",
    "link": "https://www.elgaronline.com/edcollchap/book/9781035310173/chapter23.xml"
  },
  {
    "title": "The utilization of, and the attitudes of the public to, general practitioner services: A geographical study in West Glamorgan",
    "authors": [
      "DR Phillips"
    ],
    "year": "1978",
    "abstract": "This thesis is a study of public attitudes to and utilisation of general practitioner medical \nservices in West Glamorgan, A review was undertaken of geographical and social scientific …",
    "link": "https://search.proquest.com/openview/61b6a2180db31cc4c2ac469cfbe3accc/1?pq-origsite=gscholar&cbl=2026366&diss=y"
  },
  {
    "title": "Donors' participation in Iran's health system: challenges and solutions",
    "authors": [
      "AM Mosadeghrad",
      "M Tajvar… - International Journal of …",
      "2021"
    ],
    "year": "2021",
    "abstract": "… Of the 38 interviewed donors, 13 were active in health service delivery, 14 in health … \nsuch as People’s Participation House, Neighbourhood Health Centre and health-related non-…",
    "link": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9818096/"
  },
  {
    "title": "Barriers to professional roles in urban community development",
    "authors": [
      "M O'Collins - Australian Journal of Social Issues",
      "1972"
    ],
    "year": "1972",
    "abstract": "… or the programming and service delivery in low-income urban … may lessen the effectiveness \nof service delivery and, even in a … his views about a neighbourhood health centre. Cited in …",
    "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/j.1839-4655.1972.tb00479.x"
  },
  {
    "title": "Increasing men's uptake of HIV-testing in sub-Saharan Africa: a systematic review of interventions and analyses of population-based data from rural Zambia",
    "authors": [
      "B Hensen"
    ],
    "year": "2016",
    "abstract": "… restricted to a specific male population or mode of HTC service delivery, the … neighbourhood health centre … Community-based HTC service delivery combined with community …",
    "link": "https://researchonline.lshtm.ac.uk/id/eprint/2531234"
  },
  {
    "title": "Literature review on socially inclusive budgeting",
    "authors": [
      "S Nazneen",
      "N Cole"
    ],
    "year": "2018",
    "abstract": "… of investments, including: renovation of sports surfaces at a school; installing lighting in a \ntunnel where children play in the evenings; and expanding a neighbourhood health centre to …",
    "link": "https://www.researchgate.net/profile/Sohela-Nazneen/publication/325342621_Literature_review_on_socially_inclusive_budgeting_Literature_review_on_socially_inclusive_budgeting/links/5b06aeeea6fdcc8c2523605a/Literature-review-on-socially-inclusive-budgeting-Literature-review-on-socially-inclusive-budgeting.pdf"
  },
  {
    "title": "Re-Conceptualizing\" Contributing\" Homelessness and Unpaid Labour in a Neo-Liberal Climate",
    "authors": [
      "MR Choy"
    ],
    "year": "2014",
    "abstract": "The goal of this research was to challenge notions of “contributing” in active citizen discourse. \nThis was done by exploring how individuals experiencing homelessness give back to their …",
    "link": "https://yorkspace.library.yorku.ca/items/6302a70b-ff9e-42a4-ba65-c7b2882a39cd"
  },
  {
    "title": "Colorectal Cancer Screening Behaviours of South Asian Immigrants in Canada: An Exploratory Mixed Methods Study",
    "authors": [
      "J Crawford"
    ],
    "year": "2016",
    "abstract": "An exploratory sequential mixed method study was conducted to explore factors that influence \ncolorectal cancer (CRC) screening uptake and to develop an empirically-based cross …",
    "link": "https://search.proquest.com/openview/4943bb19bcbb638a6b4b16ac6600be68/1?pq-origsite=gscholar&cbl=18750"
  },
  {
    "title": "Time, policy, management: Governing with the past",
    "authors": [
      "C Pollitt"
    ],
    "year": "2008",
    "abstract": "In this important new book, Christopher Pollitt, one of the leading researchers in public policy \nand management, argues that we are guilty of neglecting a fundamental dimension of both …",
    "link": "https://books.google.com/books?hl=en&lr=&id=A7h4T5f1e3IC&oi=fnd&pg=PR7&dq=%22neighbourhood+health+centre%22+AND+(%22model+of+care%22+OR+%22service+delivery%22)&ots=lttcFnI6PL&sig=S2BXHTs-ix1rVdtyHzbur2Kwq2c"
  },
  {
    "title": "Title not found",
    "authors": [
      "G Ben-Tovim",
      "L Beavers",
      "T Bennett",
      "J Garrett",
      "M Gibney…"
    ],
    "year": "N/A",
    "abstract": "",
    "link": "N/A"
  }
]